mdhardenburgh/Blinky/Packages/.cache/NXP.MKV10Z1287_DFP.12.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MKV10Z1287_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKV10Z1287</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="12.0.0" date="2019-06-10">NXP CMSIS packs based on MCUXpresso SDK 2.6.0</release>
    <release version="11.0.1" date="2019-04-26">Removed invalid entries from Software Content Register</release>
    <release version="11.0.0" date="2018-12-19">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.3" date="2018-07-16">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
    <release version="10.0.2" date="2018-05-25">NXP CMSIS packs based on MCUXpresso SDK 2.4.0</release>
    <release version="10.0.1" date="2018-04-04">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0" date="2018-01-19">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0" date="2017-11-17">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
  </taxonomy>
  <devices>
    <family Dfamily="MKV10Z1287" Dvendor="NXP:11">
      <description>The Kinetis® KV1x MCU family is the entry point of the V series. Built upon the ARM® Cortex®-M0+ core running at 75 MHz with hardware square root and divide capability, it delivers a 27% increase in performance in math-intensive applications versus comparable MCUs, allowing it to target BLDC as well as more computationally demanding PMSM motors. Additional features include integrated FlexCAN, dual 16-bit analog-to-digital controllers (ADCs) sampling at up to 1.2 mega samples per second (MS/s) in 12-bit mode, multiple motor control timers, up to 128 KB of flash memory and a comprehensive enablement suite from NXP® and third-party resources, including reference designs, software libraries and motor configuration tools.</description>
      <device Dname="MKV10Z128xxx7">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="750000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKV10Z128xxx7_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x020000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1ffff000" size="0x4000" access="rw" default="1"/>
        <algorithm name="arm/MKV_P128_2KB_SEC.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="MKV10Z1287.xml"/>
        <variant Dvariant="MKV10Z128VFM7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z128VFM7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV10Z128VFM7/MKV10Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKV10Z128VLC7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z128VLC7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV10Z128VLC7/MKV10Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKV10Z128VLF7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z128VLF7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV10Z128VLF7/MKV10Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKV10Z128VLH7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z128VLH7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV10Z128VLH7/MKV10Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MKV10Z64xxx7">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="750000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKV10Z64xxx7_flash.icf"/>
        </environment>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x010000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1ffff000" size="0x4000" access="rw" default="1"/>
        <algorithm name="arm/MKV_P64_2KB_SEC.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="MKV10Z1287.xml"/>
        <variant Dvariant="MKV10Z64VFM7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z64VFM7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV10Z64VFM7/MKV10Z64xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKV10Z64VLC7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z64VLC7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV10Z64VLC7/MKV10Z64xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKV10Z64VLF7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z64VLF7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV10Z64VLF7/MKV10Z64xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKV10Z64VLH7">
          <compile header="fsl_device_registers.h" define="CPU_MKV10Z64VLH7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKV10Z64VLH7/MKV10Z64xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MKV10Z128???7*" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z64???7*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.MKV10Z1287_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MKV10Z1287_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.port_AND_driver.smc_AND_driver.uart_AND_utility.debug_console">
      <accept Dname="MKV10Z128???7*" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z64???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MKV10Z1287_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
    </condition>
    <condition id="device.MKV10Z1287_AND_driver.edma">
      <accept Dname="MKV10Z128???7*" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z64???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MKV10Z1287_AND_driver.common">
      <accept Dname="MKV10Z128???7*" Dvendor="NXP:11"/>
      <accept Dname="MKV10Z64???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
